c5/src/Enums/RemoteActions/RemoteActions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RemoteActions</name>
  <enumValues>
    <name>ChangesAllow</name>
  </enumValues>
  <enumValues>
    <name>ChangesDeny</name>
  </enumValues>
  <enumValues>
    <name>MeetingMaybe</name>
  </enumValues>
  <enumValues>
    <name>MeetingNo</name>
  </enumValues>
  <enumValues>
    <name>MeetingYes</name>
  </enumValues>
  <enumValues>
    <name>PermissionAllow</name>
  </enumValues>
  <enumValues>
    <name>PermissionDeny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Document/Document.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Document</name>
  <posting>Deny</posting>
  <attributes>
    <name>AttachmentsContent</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Book</name>
    <type>
      <types>CatalogRef.Books</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsEmpty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Link</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Object</name>
    <type>
      <types>DefinedType.DocumentObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecialAccess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Versioning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>600</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ComputerName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>DocumentRef.Document</types>
        <types>DocumentRef.DocumentVersion</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/ChangesPermission/ChangesPermission.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ChangesPermission</name>
  <posting>Deny</posting>
  <attributes>
    <name>Class</name>
    <type>
      <types>CatalogRef.Metadata</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Day</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Expired</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Organization</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/ChangesPermissionMailing/Module.bsl
Procedure Send ( Document ) export
	
	profile = MailboxesSrv.SystemProfile ();
	data = getData ( Document );
	for each receiver in data.Receivers do
		message = createMessage ( Document, data, receiver );
		try
			MailboxesSrv.Post ( profile, message );
		except
			WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, , Document, ErrorDescription () );
		endtry
	enddo;
	
EndProcedure

Function getData ( Document )
	
	s = "
	|// #Receivers
	|select min ( Users.Ref ) as Ref, min ( Users.Code ) as Login, Users.Email as Email
	|from Catalog.Users as Users
	|where not Users.DeletionMark
	|and not Users.AccessDenied
	|and not Users.AccessRevoked
	|and Users.Rights.RoleName in ( """
	+ Metadata.Roles.Administrator.Name + """, """
	+ Metadata.Roles.RolesEdit.Name + """ )
	|group by Users.Email
	|;
	|// @Permission
	|select presentation ( Documents.Document ) as Document, Documents.Day as Day,
	|	Documents.Organization.Description as Organization, Documents.Company.Description as Company,
	|	Documents.Creator.Description as User
	|from Document.ChangesPermission as Documents
	|where Documents.Ref = &Ref
	|";
	data = SQL.Create ( s );
	q = data.Q;
	q.SetParameter ( "Ref", Document );
	SQL.Perform ( data );
	permission = data.Permission;
	day = Format ( permission.Day, "DLF=D" );
	details = new Structure ( "Day, User, Details",
		day,
		permission.User,
		Conversion.ValuesToString ( day, permission.Organization, permission.Document, permission.Company )
	 );
	return new Structure ( "Receivers, Details", data.Receivers, details );
	
EndFunction

Function createMessage ( Document, Data, Receiver )
	
	message = new InternetMailMessage ();
	message.From = Cloud.Noreply ();
	message.To.Add ( Receiver.Email );
	info = new Structure ( "User, Receiver, Day, Details, Yes, No" );
	FillPropertyValues ( info, Data.Details );
	login = TrimAll ( Receiver.Login );
	info.Receiver = login;
	responsible = Receiver.Ref;
	actions = InformationRegisters.RemoteActions;
	info.Yes = actions.Create ( Enums.RemoteActions.ChangesAllow, Document, responsible );
	info.No = actions.Create ( Enums.RemoteActions.ChangesDeny, Document, responsible );
	message.Subject = Output.ChangesRequestSubject ( info );
	body = Output.ChangesRequestBody ( info );
	message.Texts.Add ( body, InternetMailTextType.HTML );
	return message;

EndFunction

Procedure NotifyUser ( Params ) export
	
	creator = Params.Creator;
	receiver = DF.Pick ( creator, "Email" );
	if ( IsBlankString ( receiver ) ) then
		return;
	endif;
	info = new Structure ( "Permission, Responsible" );
	FillPropertyValues ( info, Params );
	profile = MailboxesSrv.SystemProfile ();
	message = new InternetMailMessage ();
	message.From = Cloud.Noreply ();
	message.To.Add ( receiver );
	if ( Params.Resolution = Enums.AllowDeny.Allow ) then
		message.Subject = Output.ChangesNotifyUserSubject1 ( info );
		body = Output.ChangesNotifyUserBody1 ( info );
	else
		message.Subject = Output.ChangesNotifyUserSubject2 ( info );
		body = Output.ChangesNotifyUserBody2 ( info );
	endif;
	message.Texts.Add ( body, InternetMailTextType.HTML );
	try
		MailboxesSrv.Post ( profile, message );
	except
		WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, , Params.Permission,
			ErrorDescription () );
	endtry
	
EndProcedure
